import {Component, Input, OnInit} from '@angular/core';
import {EChartsOption} from "echarts";

@Component({
  selector: 'app-port-operator-cargo-forwarder-chart',
  templateUrl: './port-operator-cargo-forwarder-chart.component.html',
  styleUrls: ['./port-operator-cargo-forwarder-chart.component.css']
})
export class PortOperatorCargoForwarderChartComponent implements OnInit {
  @Input() title: string = "";
  data = {"nodes": [
      {"name": "Морський порт Ізмаїл"},
      {"name": "ІМТП ДП / ВПК ДВР"},
      {"name": "ПШЕНИЦЯ НАСИПОМ"},
      {"name": "ПП 'ЕТМК'"},
      {"name": "ТОВ 'ЛОДЖИСТЛІ'"},
      {"name": "ТОВ `ГРАНОВА ЛОГІСТІК`"},
      {"name": "ПП 'РЕНІЛІС'"},
      {"name": "ТОВ 'ВІКТОРІЯ 2008'"},
      {"name": "ГОРОХ НАСИПОМ"},
      {"name": "АЗОТНІ ДОБРИВА В БІГБЕГАХ"},
      {"name": "АММОФОС В БІГ-БЕГАХ"},
      {"name": "АММОНІЯ НІТРАТ НАВАЛ"},
      {"name": "ІМТП ДП / ВПК ПВР"},
      {"name": "БЕНЗИН НАЛИВОМ"},
      {"name": "ТОВ 'ЮНАЙТЕД ГЛОБАЛ ЛОДЖИСТІК'"},
      {"name": "ДИЗЕЛЬНЕ ПАЛИВО НАЛИВОМ"},
      {"name": "ГАЗ ЗРІДЖЕНИЙ"},
      {"name": "МЕТАЛ"},
      {"name": "МЕТАЛОПРОДУКЦІЯ У ЗВ’ЯЗКАХ"},
      {"name": "ЛЬОН"},
      {"name": "НАСІННЯ РАПСУ"},
      {"name": "ОЛІЯ СОНЯШНИКОВА НАЛИВОМ"},
      {"name": "ШРОТ СОНЯЧНИЙ"},
      {"name": "СІЛЬ ТЕХНІЧНА"}
    ],
    "links": [
      {"source": "Морський порт Ізмаїл", "target": "ІМТП ДП / ВПК ДВР", "value": Math.round(0.342284047256003*100000)},
      {"source": "ІМТП ДП / ВПК ДВР", "target": "ПШЕНИЦЯ НАСИПОМ", "value": Math.round(0.32322870366987*100000)},
      {"source": "ПШЕНИЦЯ НАСИПОМ", "target": "ПП 'ЕТМК'", "value": Math.round(0.177682517071359*100000)},
      {"source": "ПШЕНИЦЯ НАСИПОМ", "target": "ТОВ 'ЛОДЖИСТЛІ'", "value": Math.round(0.137241325342711*100000)},
      {"source": "ПШЕНИЦЯ НАСИПОМ", "target": "ТОВ `ГРАНОВА ЛОГІСТІК`", "value": Math.round(0.00433076373512774*100000)},
      {"source": "ПШЕНИЦЯ НАСИПОМ", "target": "ПП 'РЕНІЛІС'", "value": Math.round(0.00296956039863467*100000)},
      {"source": "ПШЕНИЦЯ НАСИПОМ", "target": "ТОВ 'ВІКТОРІЯ 2008'", "value": Math.round(0.00100453712203756*100000)},
      {"source": "ІМТП ДП / ВПК ДВР", "target": "ГОРОХ НАСИПОМ", "value": Math.round(0.0112886157414413*100000)},
      {"source": "ГОРОХ НАСИПОМ", "target": "ПП 'ЕТМК'", "value": Math.round(0.00676852971933996*100000)},
      {"source": "ГОРОХ НАСИПОМ", "target": "ТОВ 'ЛОДЖИСТЛІ'", "value": Math.round(0.00394686874786743*100000)},
      {"source": "ГОРОХ НАСИПОМ", "target": "ПП 'РЕНІЛІС'", "value": Math.round(0.000315972058711838*100000)},
      {"source": "ГОРОХ НАСИПОМ", "target": "ТОВ `ГРАНОВА ЛОГІСТІК`", "value": Math.round(0.000218969462265292*100000)},
      {"source": "ГОРОХ НАСИПОМ", "target": "ТОВ 'ВІКТОРІЯ 2008'", "value": Math.round(3.82757532567656e-05*100000)},
      {"source": "ІМТП ДП / ВПК ДВР", "target": "АЗОТНІ ДОБРИВА В БІГБЕГАХ", "value": Math.round(0.00604275542495656*100000)},
      {"source": "АЗОТНІ ДОБРИВА В БІГБЕГАХ", "target": "ТОВ 'ЛОДЖИСТЛІ'", "value": Math.round(0.0055125989240741*100000)},
      {"source": "АЗОТНІ ДОБРИВА В БІГБЕГАХ", "target": "ПП 'ЕТМК'", "value": Math.round(0.000330017607892127*100000)},
      {"source": "АЗОТНІ ДОБРИВА В БІГБЕГАХ", "target": "ПП 'РЕНІЛІС'", "value": Math.round(0.000200138892990337*100000)},
      {"source": "ІМТП ДП / ВПК ДВР", "target": "АММОФОС В БІГ-БЕГАХ", "value": Math.round(0.00148345269044703*100000)},
      {"source": "АММОФОС В БІГ-БЕГАХ", "target": "ПП 'ЕТМК'", "value": Math.round(0.00135309891304186*100000)},
      {"source": "АММОФОС В БІГ-БЕГАХ", "target": "ТОВ 'ЛОДЖИСТЛІ'", "value": Math.round(0.000105714137908639*100000)},
      {"source": "АММОФОС В БІГ-БЕГАХ", "target": "ТОВ `ГРАНОВА ЛОГІСТІК`", "value": Math.round(1.33452642581887e-05*100000)},
      {"source": "АММОФОС В БІГ-БЕГАХ", "target": "ПП 'РЕНІЛІС'", "value": Math.round(8.78074837009238e-06*100000)},
      {"source": "АММОФОС В БІГ-БЕГАХ", "target": "ТОВ 'ВІКТОРІЯ 2008'", "value": Math.round(2.5136268682477e-06*100000)},
      {"source": "ІМТП ДП / ВПК ДВР", "target": "АММОНІЯ НІТРАТ НАВАЛ", "value": Math.round(0.000240519729288764*100000)},
      {"source": "АММОНІЯ НІТРАТ НАВАЛ", "target": "ПП 'РЕНІЛІС'", "value": Math.round(0.000226237279345084*100000)},
      {"source": "АММОНІЯ НІТРАТ НАВАЛ", "target": "ТОВ 'ВІКТОРІЯ 2008'", "value": Math.round(1.42824499436793e-05*100000)},
      {"source": "Морський порт Ізмаїл", "target": "ІМТП ДП / ВПК ПВР", "value": Math.round(0.307574096993239*100000)},
      {"source": "ІМТП ДП / ВПК ПВР", "target": "БЕНЗИН НАЛИВОМ", "value": Math.round(0.0410641202645833*100000)},
      {"source": "БЕНЗИН НАЛИВОМ", "target": "ТОВ `ГРАНОВА ЛОГІСТІК`", "value": Math.round(0.0105339381639722*100000)},
      {"source": "БЕНЗИН НАЛИВОМ", "target": "ТОВ 'ЛОДЖИСТЛІ'", "value": Math.round(0.0105*100000)},
      {"source": "БЕНЗИН НАЛИВОМ", "target": "ПП 'ЕТМК'", "value": Math.round(0.0087294420777*100000)},
      {"source": "БЕНЗИН НАЛИВОМ", "target": "ТОВ 'ЮНАЙТЕД ГЛОБАЛ ЛОДЖИСТІК'", "value": Math.round(0.00474399974233333*100000)},
      {"source": "БЕНЗИН НАЛИВОМ", "target": "ПП 'РЕНІЛІС'", "value": Math.round(0.00388226450884445*100000)},
      {"source": "БЕНЗИН НАЛИВОМ", "target": "ТОВ 'ВІКТОРІЯ 2008'", "value": Math.round(0.00267447577173333*100000)},
      {"source": "ІМТП ДП / ВПК ПВР", "target": "ДИЗЕЛЬНЕ ПАЛИВО НАЛИВОМ", "value": Math.round(0.0365458590642445*100000)},
      {"source": "ДИЗЕЛЬНЕ ПАЛИВО НАЛИВОМ", "target": "ТОВ `ГРАНОВА ЛОГІСТІК`", "value": Math.round(0.0114913076376389*100000)},
      {"source": "ДИЗЕЛЬНЕ ПАЛИВО НАЛИВОМ", "target": "ПП 'ЕТМК'", "value": Math.round(0.0081134807347*100000)},
      {"source": "ДИЗЕЛЬНЕ ПАЛИВО НАЛИВОМ", "target": "ТОВ 'ЛОДЖИСТЛІ'", "value": Math.round(0.00765230236575*100000)},
      {"source": "ДИЗЕЛЬНЕ ПАЛИВО НАЛИВОМ", "target": "ПП 'РЕНІЛІС'", "value": Math.round(0.004*100000)},
      {"source": "ДИЗЕЛЬНЕ ПАЛИВО НАЛИВОМ", "target": "ТОВ 'ВІКТОРІЯ 2008'", "value": Math.round(0.00296668823626667*100000)},
      {"source": "ДИЗЕЛЬНЕ ПАЛИВО НАЛИВОМ", "target": "ТОВ 'ЮНАЙТЕД ГЛОБАЛ ЛОДЖИСТІК'", "value": Math.round(0.00232208008988889*100000)},
      {"source": "ІМТП ДП / ВПК ПВР", "target": "ГАЗ ЗРІДЖЕНИЙ", "value": Math.round(0.0345435327843611*100000)},
      {"source": "ГАЗ ЗРІДЖЕНИЙ", "target": "ТОВ `ГРАНОВА ЛОГІСТІК`", "value": Math.round(0.0121419536385*100000)},
      {"source": "ГАЗ ЗРІДЖЕНИЙ", "target": "ТОВ 'ЛОДЖИСТЛІ'", "value": Math.round(0.00766772850678333*100000)},
      {"source": "ГАЗ ЗРІДЖЕНИЙ", "target": "ПП 'ЕТМК'", "value": Math.round(0.0056245892061*100000)},
      {"source": "ГАЗ ЗРІДЖЕНИЙ", "target": "ТОВ 'ЮНАЙТЕД ГЛОБАЛ ЛОДЖИСТІК'", "value": Math.round(0.00361616847688889*100000)},
      {"source": "ГАЗ ЗРІДЖЕНИЙ", "target": "ПП 'РЕНІЛІС'", "value": Math.round(0.00277374682533333*100000)},
      {"source": "ГАЗ ЗРІДЖЕНИЙ", "target": "ТОВ 'ВІКТОРІЯ 2008'", "value": Math.round(0.00271934613075556*100000)},
      {"source": "ІМТП ДП / ВПК ПВР", "target": "МЕТАЛ", "value": Math.round(0.0340206659360667*100000)},
      {"source": "МЕТАЛ", "target": "ТОВ 'ЛОДЖИСТЛІ'", "value": Math.round(0.0105*100000)},
      {"source": "МЕТАЛ", "target": "ПП 'ЕТМК'", "value": Math.round(0.0089274160792*100000)},
      {"source": "МЕТАЛ", "target": "ТОВ `ГРАНОВА ЛОГІСТІК`", "value": Math.round(0.0054148022845*100000)},
      {"source": "МЕТАЛ", "target": "ПП 'РЕНІЛІС'", "value": Math.round(0.00333938149786667*100000)},
      {"source": "МЕТАЛ", "target": "ТОВ 'ВІКТОРІЯ 2008'", "value": Math.round(0.00314663377488889*100000)},
      {"source": "МЕТАЛ", "target": "ТОВ 'ЮНАЙТЕД ГЛОБАЛ ЛОДЖИСТІК'", "value": Math.round(0.00269243229961111*100000)},
      {"source": "ІМТП ДП / ВПК ПВР", "target": "МЕТАЛОПРОДУКЦІЯ У ЗВ’ЯЗКАХ", "value": Math.round(0.0320571523941667*100000)},
      {"source": "МЕТАЛОПРОДУКЦІЯ У ЗВ’ЯЗКАХ", "target": "ТОВ `ГРАНОВА ЛОГІСТІК`", "value": Math.round(0.0132312483463611*100000)},
      {"source": "МЕТАЛОПРОДУКЦІЯ У ЗВ’ЯЗКАХ", "target": "ПП 'ЕТМК'", "value": Math.round(0.0077695200707*100000)},
      {"source": "МЕТАЛОПРОДУКЦІЯ У ЗВ’ЯЗКАХ", "target": "ТОВ 'ЛОДЖИСТЛІ'", "value": Math.round(0.00510606573995*100000)},
      {"source": "МЕТАЛОПРОДУКЦІЯ У ЗВ’ЯЗКАХ", "target": "ТОВ 'ВІКТОРІЯ 2008'", "value": Math.round(0.00354321156324444*100000)},
      {"source": "МЕТАЛОПРОДУКЦІЯ У ЗВ’ЯЗКАХ", "target": "ПП 'РЕНІЛІС'", "value": Math.round(0.00240710667391111*100000)},
      {"source": "ІМТП ДП / ВПК ПВР", "target": "ЛЬОН", "value": Math.round(0.0315022209894056*100000)},
      {"source": "ЛЬОН", "target": "ТОВ `ГРАНОВА ЛОГІСТІК`", "value": Math.round(0.00964970063322223*100000)},
      {"source": "ЛЬОН", "target": "ТОВ 'ЛОДЖИСТЛІ'", "value": Math.round(0.00938530207965*100000)},
      {"source": "ЛЬОН", "target": "ПП 'ЕТМК'", "value": Math.round(0.0060110791848*100000)},
      {"source": "ЛЬОН", "target": "ПП 'РЕНІЛІС'", "value": Math.round(0.00380818314608889*100000)},
      {"source": "ЛЬОН", "target": "ТОВ 'ВІКТОРІЯ 2008'", "value": Math.round(0.00264795594564445*100000)},
      {"source": "ІМТП ДП / ВПК ПВР", "target": "НАСІННЯ РАПСУ", "value": Math.round(0.0287776757227333*100000)},
      {"source": "НАСІННЯ РАПСУ", "target": "ТОВ 'ЛОДЖИСТЛІ'", "value": Math.round(0.00883512456493333*100000)},
      {"source": "НАСІННЯ РАПСУ", "target": "ПП 'ЕТМК'", "value": Math.round(0.0078343367268*100000)},
      {"source": "НАСІННЯ РАПСУ", "target": "ТОВ 'ЮНАЙТЕД ГЛОБАЛ ЛОДЖИСТІК'", "value": Math.round(0.00347879026511111*100000)},
      {"source": "НАСІННЯ РАПСУ", "target": "ТОВ `ГРАНОВА ЛОГІСТІК`", "value": Math.round(0.00316254211388889*100000)},
      {"source": "НАСІННЯ РАПСУ", "target": "ТОВ 'ВІКТОРІЯ 2008'", "value": Math.round(0.00281013722808889*100000)},
      {"source": "НАСІННЯ РАПСУ", "target": "ПП 'РЕНІЛІС'", "value": Math.round(0.00265674482391111*100000)},
      {"source": "ІМТП ДП / ВПК ПВР", "target": "ОЛІЯ СОНЯШНИКОВА НАЛИВОМ", "value" : Math.round(0.0271146645119444*100000)},
      {"source": "ОЛІЯ СОНЯШНИКОВА НАЛИВОМ", "target": "ПП 'ЕТМК'", "value": Math.round(0.0071042315061*100000)},
      {"source": "ОЛІЯ СОНЯШНИКОВА НАЛИВОМ", "target": "ТОВ 'ЛОДЖИСТЛІ'", "value": Math.round(0.00636673210005*100000)},
      {"source": "ОЛІЯ СОНЯШНИКОВА НАЛИВОМ", "target": "ТОВ `ГРАНОВА ЛОГІСТІК`", "value": Math.round(0.00601459775836111*100000)},
      {"source": "ОЛІЯ СОНЯШНИКОВА НАЛИВОМ", "target": "ТОВ 'ЮНАЙТЕД ГЛОБАЛ ЛОДЖИСТІК'", "value": Math.round(0.00429185583138889*100000)},
      {"source": "ОЛІЯ СОНЯШНИКОВА НАЛИВОМ", "target": "ПП 'РЕНІЛІС'", "value": Math.round(0.00182647471915556*100000)},
      {"source": "ОЛІЯ СОНЯШНИКОВА НАЛИВОМ", "target": "ТОВ 'ВІКТОРІЯ 2008'", "value": Math.round(0.00151077259688889*100000)},
      {"source": "ІМТП ДП / ВПК ПВР", "target": "ШРОТ СОНЯЧНИЙ", "value": Math.round(0.0211217763359833*100000)},
      {"source": "ШРОТ СОНЯЧНИЙ", "target": "ТОВ 'ЛОДЖИСТЛІ'", "value": Math.round(0.00609671700306667*100000)},
      {"source": "ШРОТ СОНЯЧНИЙ", "target": "ПП 'ЕТМК'", "value": Math.round(0.0047738806325*100000)},
      {"source": "ШРОТ СОНЯЧНИЙ", "target": "ТОВ 'ЮНАЙТЕД ГЛОБАЛ ЛОДЖИСТІК'", "value": Math.round(0.00368119084494444*100000)},
      {"source": "ШРОТ СОНЯЧНИЙ", "target": "ТОВ 'ВІКТОРІЯ 2008'", "value": Math.round(0.00286009813604444*100000)},
      {"source": "ШРОТ СОНЯЧНИЙ", "target": "ПП 'РЕНІЛІС'", "value": Math.round(0.00283706180951111*100000)},
      {"source": "ШРОТ СОНЯЧНИЙ", "target": "ТОВ `ГРАНОВА ЛОГІСТІК`", "value": Math.round(0.000872827909916666*100000)},
      {"source": "ІМТП ДП / ВПК ПВР", "target": "СІЛЬ ТЕХНІЧНА", "value": Math.round(0.02082642898975*100000)},
      {"source": "СІЛЬ ТЕХНІЧНА", "target": "ТОВ `ГРАНОВА ЛОГІСТІК`", "value": Math.round(0.0107216773848333*100000)},
      {"source": "СІЛЬ ТЕХНІЧНА", "target": "ТОВ 'ЮНАЙТЕД ГЛОБАЛ ЛОДЖИСТІК'", "value": Math.round(0.00359009052944444*100000)},
      {"source": "СІЛЬ ТЕХНІЧНА", "target": "ТОВ 'ВІКТОРІЯ 2008'", "value": Math.round(0.00212300379075556*100000)},
      {"source": "СІЛЬ ТЕХНІЧНА", "target": "ПП 'ЕТМК'", "value": Math.round(0.0018518584356*100000)},
      {"source": "СІЛЬ ТЕХНІЧНА", "target": "ТОВ 'ЛОДЖИСТЛІ'", "value": Math.round(0.00158227069058333*100000)},
      {"source": "СІЛЬ ТЕХНІЧНА", "target": "ПП 'РЕНІЛІС'", "value": Math.round(0.000957528158533333*100000)}
    ]}

  /** Based on the screen size, switch from standard to one column per row */

  public options: EChartsOption = {};
  ngOnInit(): void {

    this.options = {
      // title: {
      //   text: 'Sankey Diagram'
      // },
      tooltip: {
        trigger: 'item',
        triggerOn: 'mousemove'
      },
      series: [
        {
          type: 'sankey',
          data: this.data.nodes,
          links: this.data.links,
          emphasis: {
            focus: 'adjacency'
          },
          levels: [
            {
              depth: 0,
              itemStyle: {
                color: '#fbb4ae'
              },
              lineStyle: {
                color: 'source',
                opacity: 0.6
              }
            },
            {
              depth: 1,
              itemStyle: {
                color: '#b3cde3'
              },
              lineStyle: {
                color: 'source',
                opacity: 0.6
              }
            },
            {
              depth: 2,
              itemStyle: {
                color: '#ccebc5'
              },
              lineStyle: {
                color: 'source',
                opacity: 0.6
              }
            },
            {
              depth: 3,
              itemStyle: {
                color: '#decbe4'
              },
              lineStyle: {
                color: 'source',
                opacity: 0.6
              }
            }
          ],
          lineStyle: {
            curveness: 0.5
          }
        }
      ]
    }
  }
}
